Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: If the condition evaluates to true, the conditional operator evaluates the first expression and returns its value.
ja: 条件がtrueに評価されるならば、条件演算子は最初の式を評価して、その値を返します。

source: If the constant name of a constant declaration is a tuple pattern, the name of each item in the tuple is bound to the corresponding value in the initializer expression.
ja: 定数宣言の定数名がタプルパターンであるならば、タプルの中の各項目の名前は、イニシャライザ式の中の対応する値に縛りつけられます。

source: If the expression does not throw an error, the value of the optional-try expression is an optional containing the value of the expression.
ja: このexpression（式）がエラーをスローしないならば、オプショナルtry式の値はひとつのオプショナルになり、そのexpression（式）の値を含んでいます。

source: If the expression throws an error, a runtime error is produced.
ja: このexpression（式）がエラーをスローするならば、実行時エラーが生み出されます。

source: If the type name is a class, structure, or enumeration type, the extension extends that type.
ja: type nameがクラス、構造体、または列挙型ならば、その拡張はその型を拡張します。

source: If the type name is a protocol type, the extension extends all types that conform to that protocol.
ja: type nameがプロトコル型ならば、その拡張はそのプロトコルに準拠するすべての型を拡張します。

source: If the expression is a tuple, the value must be a tuple with the same number of elements.
ja: 式がタプルであるならば、値は同じ数の要素をもつタプルでなければなりません。

source: If the Boolean condition in the assertion or precondition evaluates to true, code execution continues as usual.
ja: 表明または前提条件におけるブール条件がtrueに評価されるならば、コードは普段通り続けて実行されます。

source: If the captured reference will never become nil, it should always be captured as an unowned reference, rather than a weak reference.
ja: 捕獲された参照が決してnilにならないならば、それは常に、非所有参照として捕らえられなければなりません、弱い参照ではなくて。

source: If the case contains multiple patterns that match the control expression, all of the patterns must contain the same constant or variable bindings, and each bound variable or constant must have the same type in all of the case’s patterns.
ja: 制御式にマッチする複数のパターンをケース節が含むならば、そのパターンのすべてが同じ定数または変数束縛を含まなければなりません、そして束縛された変数または定数の各々は、そのケース節の持つパターンのすべてで同じ型を持たなければなりません。

source: If the cast fails, a runtime error is raised.
ja: キャストが失敗したならば、実行時エラーが引き起こされます。

source: If the class doesn’t inherit from another class, the list can begin with a protocol instead.
ja: クラスが別のクラスから継承しないならば、このリストは代わりにプロトコルで始まることが出来ます。

source: If the class inherits any properties from its superclass, one of the superclass’s designated initializers must be called before any of these properties can be set or modified in the current class.
ja: クラスが何らかのプロパティをそのスーパークラスから受け継ぐならば、これらのプロパティのどれかが現在のクラスにおいて設定または修正されることができる前に、スーパークラスの指定イニシャライザのうちの１つが呼ばれなければなりません。

source: If the closure is never called, the expression inside the closure is never evaluated, which means the array element is never removed.
ja: このクロージャが決して呼び出されないならば、クロージャ内部の式は決して評価されません、それは配列要素が決して取り除かれないことを意味します。

source: If the code already checks the condition, you use the assertionFailure(_:file:line:) [https://developer.apple.com/documentation/swift/1539616-assertionfailure] function to indicate that an assertion has failed.
ja: コードがすでに条件を調べるならば、あなたはassertionFailure(_:file:line:) [https://developer.apple.com/documentation/swift/1539616-assertionfailure]関数を使って表明が失敗していることを示してください。

source: If the compiler can prove that the constant’s value is never read, the constant isn’t required to have a value set at all.
ja: 定数のもつ値が決して読み出されないことをコンパイラが立証できるならば、定数は値を設定されることを全く要求されません。

source: If the compiler can’t prove the access is safe, it doesn’t allow the access.
ja: コンパイラがそのアクセスを安全であると立証できないならば、それはアクセスを許可しません。

source: If the condition evaluates to false, the current state of the program is invalid; code execution ends, and your app is terminated.
ja: 条件がfalseに評価されるならば、プログラムの現在の状態は無効です；コード実行は止まり、そしてあなたのアプリは終了させられます。

source: If the condition is true, a set of statements is repeated until the condition becomes false.
ja: その条件がtrueならば、条件がfalseになるまで、ひとかたまりの文が繰り返されます。

source: If the context already provides type information, you can create an empty dictionary with an empty dictionary literal, which is written as [:] (a colon inside a pair of square brackets):
ja: 前後関係がすでに型の情報を提供するならば、あなたは[:]（一対の角括弧の内側のひとつのコロン）として書かれる空の辞書リテラルを使って、空の辞書を作成することができます：

source: If the conversion is successful, the actualNumber constant becomes available for use within the first branch of the if statement.
ja: 変換が成功しているならば、定数actualNumberは、if文の最初の分岐の内部での利用に役立てられます。

source: If the dice roll will move the player beyond the final square, the move is invalid and the player needs to roll again.
ja: さいころの目が最後の正方形を越えてプレーヤーを動かすならば、その移動は無効です、そしてプレーヤーは再びさいころを振る必要があります。

source: If the dice roll will move the player onto the final square, the game is over.
ja: さいころの目が最後の正方形の上へプレーヤーを動かすならば、ゲームは終わります。

source: If the dictionary contains a value for the requested key, the subscript returns an optional value containing the existing value for that key.
ja: その辞書が要請されたキーに対する値を含むならば、添え字はそのキーに対する既存の値を含んでいるオプショナルの値を返します。

source: If the downcasting succeeds, the properties of movie are then used to print a description for that Movie instance, including the name of its director.
ja: ダウンキャストが成功するならば、movieのプロパティがそれから使用されて、そのMovieインスタンスの、それのdirector（監督）の名前を含む説明を出力することになります。

source: If the entire body of a getter is a single expression, the getter implicitly returns that expression.
ja: ゲッターの全本文が単一の式ならば、ゲッターは暗黙的にその式を返します。

source: If the entire body of the function is a single expression, the function implicitly returns that expression.
ja: 関数の本文全体がある単一の式であるならば、その関数は暗黙的にその式を返します。

source: If the enumeration case you’re trying to match has any associated values, the corresponding enumeration case pattern must specify a tuple pattern that contains one element for each associated value.
ja: あなたがマッチしようとしている列挙ケース節が関連値を持つならば、対応する列挙ケース節パターンは、各関連値に対して１つの要素を含んでいるタプルパターンを指定しなければなりません。

source: If the error propagates to the top-level scope without being handled, you’ll get a runtime error.
ja: エラーが取り扱われることなくトップレベルスコープに伝わるならば、あなたは実行時エラーを得るでしょう。

source: If the first case doesn’t have a value set, its value is 0.
ja: 最初のケース節が値を設定されないならば、それの値は0です。

source: If the first string (s1) is greater than the second string (s2), the backward(_:_:) function will return true, indicating that s1 should appear before s2 in the sorted array.
ja: 最初の文字列（s1）が第二の文字列（s2）より大きいならば、backward(_:_:)関数は、ソートされた配列においてs1がs2の前に現れなければならないことを示す、trueを返します。

source: If the function definition includes names for its parameters, the function call must include names before its argument values separated by a colon (:).
ja: 関数定義がそれのパラメータたちの名前を含むならば、関数呼び出しはそれらの引数値の前にその名前をコロン（:）で区切って含まなければなりません。

source: If the function has a return type of Void, the return type can be omitted as follows:
ja: 関数がVoidの戻り型を持つならば、次のように戻り型は省略されることができます：

source: If the function specifies a return type, you write the throws keyword before the return arrow (->).
ja: その関数が戻り型を指定するならば、あなたはthrowsキーワードを戻り矢印（->）の前に書きます。

source: If the function throws an error, the specific error is discarded and the result is nil.
ja: 関数がエラーをスローするならば、その具体的なエラーは廃棄されます、そしてその結果はnilになります。

source: If the initial value doesn’t provide enough information (or if there is no initial value), specify the type by writing it after the variable, separated by a colon.
ja: 最初の値が十分な情報を提供しないならば（または最初の値がないならば）、変数の後にコロンで区切ってそれを書くことによって型を指定してください。

source: If the left side of a Logical OR expression is true, the right side is not evaluated, because it can’t change the outcome of the overall expression.
ja: 論理和式の左側がtrueならば、右側は評価されません、なぜならそれが式全体の結論を変えることができないからです。

source: If the loop finishes without finding a mismatch, the two containers match, and the function returns true.
ja: ループが一致しない組合せを見つけることなく終わるならば、２つのコンテナは合致します、そして関数はtrueを返します。

source: If the match succeeds, the type of the matched value is cast to the pattern specified in the right-hand side of the as pattern.
ja: マッチが成功するならば、マッチされた値の型は、asパターンの右手側で指定されるパターンにキャストされます。

source: If the module is present, the platform condition returns true; otherwise, it returns false.
ja: そのモジュールが存在するならば、プラットホーム条件はtrueを返します；そうでなければ、それはfalseを返します。

source: If the new value of currentLevel (after any capping) is higher than any value previously received by any AudioChannel instance, the property observer stores the new currentLevel value in the maxInputLevelForAllChannels type property.
ja: currentLevelの新しい値が（制限を受けた後に）あらゆるAudioChannelインスタンスで以前に受けた値より高いならば、プロパティオブザーバーは、新しいcurrentLevel値を型プロパティmaxInputLevelForAllChannelsに保管します。

source: If the new value of currentLevel is greater than the allowed thresholdLevel, the property observer caps currentLevel to thresholdLevel.
ja: currentLevelの新しい値が許可されたthresholdLevelより大きいならば、このプロパティオブザーバーはcurrentLevelをthresholdLevelに制限します。

source: If the omitted types can’t be inferred, a compile-time error is raised.
ja: 省略された型が推論されることができないならば、コンパイル時エラーが引き起こされます。

source: If the optional Int does contain a value—that is, if the delegate and method both exist, and the method returned a value—the unwrapped amount is added onto the stored count property, and incrementation is complete.
ja: オプショナルのIntが値を含むならば ― すなわち、委任先とメソッドが両方とも存在する、そしてメソッドが値を返すならば ― アンラップされたamountが格納countプロパティへと加えられます、そして増加作業は完了です。

source: If the optional contains a value, the property, method, or subscript call succeeds; if the optional is nil, the property, method, or subscript call returns nil.
ja: そのオプショナルが値を含むならば、プロパティ、メソッド、または添え字の呼び出しは成功します；そのオプショナルがnilであるならば、プロパティ、メソッド、または添え字の呼び出しはnilを返します。

source: If the optional value is nil, the conditional is false and the code in braces is skipped.
ja: オプショナルの値がnilならば、この条件文はfalseになります、そして波括弧の中のコードはスキップされます。

source: If the optional value is missing, the default value is used instead.
ja: オプショナル値が見つからないならば、省略時の値が代わりに使われます。

source: If the parameter is omitted when calling the function, the default value is used instead.
ja: パラメーターが関数呼び出し時に省略されるならば、省略時の値が代わりに使われます。

source: If the player has moved on or beyond square number 25, the loop’s condition evaluates to false and the game ends.
ja: プレーヤーが25番目の正方形の上にまたは越えて移動したならば、ループの条件はfalseに評価してゲームは終わります。

source: If the protocol only requires a property to be gettable, the requirement can be satisfied by any kind of property, and it’s valid for the property to be also settable if this is useful for your own code.
ja: プロトコルがプロパティに取得可能であるのを要求するだけならば、その要件はどんなプロパティにでもよって満たされることができます、そして、同時にまた設定可能でもあることは、もしそれがあなた自身のコードに役立つ場合には、そのプロパティにとって有効です。

source: If the raw-value type is specified as Int and you don’t assign a value to the cases explicitly, they are implicitly assigned the values 0, 1, 2, and so on.
ja: もし生の値型がIntとして指定され、あなたが明示的に値をそれぞれのケース節に割り当てないならば、それらは暗黙のうちに値0、1、2、等々を割り当てられます。

source: If the raw-value type is specified as String and you don’t assign values to the cases explicitly, each unassigned case is implicitly assigned a string with the same text as the name of that case.
ja: 「生の値」型がStringとして指定されてあなたが明示的に値をそのケース節に割り当てないならば、未割り当てのケース節のそれぞれは暗黙的にそのケース節の名前である同じテキストをもつ文字列を割り当てられます。

source: If the right side of the assignment is a tuple with multiple values, its elements can be decomposed into multiple constants or variables at once:
ja: 代入の右側が、複数の値をもつタプルであるならば、その要素は同時に複数の定数または変数に分解されることができます：

source: If the specified key isn’t contained in the dictionary, the subscript returns nil.
ja: 指定されたキーがその辞書に含まれないならば、添え字はnilを返します。

source: If the square’s value is greater than 0, it’s the base of a ladder, and is represented by ▲.
ja: 正方形の値が0より大きいならば、それははしごの基部であって、▲によって表されます。

source: If the square’s value is less than 0, it’s the head of a snake, and is represented by ▼.
ja: 正方形の値が0より小さいならば、それはヘビの頭であって、▼によって表されます。

source: If the stack is empty, topItem returns nil; if the stack isn’t empty, topItem returns the final item in the items array.
ja: スタックが空ならば、topItemはnilを返します；スタックが空でないならば、topItemはitems配列の最後の項目を返します。

source: If the subclass overrides all of the superclass’s designated initializers, it inherits the superclass’s convenience initializers.
ja: サブクラスがスーパークラスの指定イニシャライザのすべてをオーバーライドするならば、それはスーパークラスの便宜イニシャライザたちを継承します。

source: If the subscript declaration includes both the get and set keywords, a conforming type must implement both a getter and a setter clause.
ja: 添え字宣言がgetとsetキーワードを両方とも含むならば、準拠している型はゲッターとセッター節を両方とも実装しなければなりません。

source: If the subscript declaration includes only the get keyword, a conforming type must implement at least a getter clause and optionally can implement a setter clause.
ja: 添え字宣言がgetキーワードだけを含むならば、準拠している型は、少なくともゲッター節を実装しなければなりません、そして随意にセッター節を実装することができます。

source: If the total number of steps has increased, a message is printed to indicate how many new steps have been taken.
ja: 総歩数が増加したならば、どれくらいの新たな歩数がとられたかについて示すためにメッセージが出力されます。

source: If the trailing closure is the function’s only argument, the parentheses can be omitted.
ja: 後付クロージャが関数のただ１つの引数であるならば、括弧は省略されることができます。

source: If the tuple type to be returned from a function has the potential to have “no value” for the entire tuple, you can use an optional tuple return type to reflect the fact that the entire tuple can be nil.
ja: ある関数から返されるタプル型がタプル全体として「値がない」見込みがあるならば、あなたはタプル全体がnilであることが出来るのを反映するためにオプショナルタプルの戻り型を使うことが出来ます。

source: If the two items aren’t equal, then the two containers don’t match, and the function returns false.
ja: ２つの項目が等しくないならば、２つのコンテナは合致しません、そして関数はfalseを返します。

source: If the type already implements all of the requirements, you can leave the body of the extension declaration empty.
ja: その型が要件の全てをすでに実装するならば、あなたは拡張宣言の本文を空のままにしておいてかまいません。

source: If the type conversion cannot maintain the value, the initializer fails.
ja: 型変換が値を維持できないならば、イニシャライザは失敗します。

source: If the type defines both a call-as-function method and one of the methods used by the dynamicCallable attribute, the compiler gives preference to the call-as-function method in circumstances where either method could be used.
ja: その型がcall-as-functionメソッドとdynamicCallableによって使われるメソッドの１つを両方とも定義するならば、コンパイラは、どちらのメソッドも使用できる環境ではcall-as-functionメソッドを優先します。

source: If the type of the expression’s value is a class, you can mark the expression in a capture list with weak or unowned to capture a weak or unowned reference to the expression’s value.
ja: この式の値の型がクラスならば、あなたはその式をキャプチャリストの中でweakまたはunownedを使って印を付けて、式の値に対する弱いまたは非所有の参照をキャプチャすることができます。

source: If the type they extend is also in the same file, they share the type’s access-control scope.
ja: それらが拡張した型もまた同じファイルにあるならば、それらはその型のもつアクセス制御スコープを共有します。

source: If the type you are trying to retrieve is already optional, it will not become more optional because of the chaining.
ja: あなたが取り出そうとしている型がすでにオプショナルならば、それは連鎖であることからさらにオプショナルにはなりません。

source: If the type you are trying to retrieve is not optional, it will become optional because of the optional chaining.
ja: あなたが取り出そうとしている型がオプショナルでないならば、それはオプショナル連鎖であることからオプショナルになります。

source: If the value before the ? is nil, everything after the ? is ignored and the value of the whole expression is nil.
ja: ?の前の値がnilならば、?の後のすべてのものは、無視されて、その全体の式の値はnilです。

source: If the value is nil, no operation is performed and therefore no runtime error is produced.
ja: その値がnilならば、演算は実行されません、したがって、実行時エラーは生じません。

source: If the value of a is non-nil, the value of b is not evaluated.
ja: aの値がnilでないならば、bの値は評価されません。

source: If the value of a is equal to b, then the resulting range will be empty.
ja: aの値がbと等しいならば、そのとき結果として生じる範囲は空になります。

source: If the value of age is negative, as in the code above, then age >= 0 evaluates to false, and the assertion fails, terminating the application.
ja: ageの値が負であるならば、上のコードでのように、そのときage >= 0はfalseに評価され、そして表明は失敗して、アプリケーションを終了します。

source: If the value of integerToDescribe is one of the prime numbers in the list, the function appends text to the end of description, to note that the number is prime.
ja: integerToDescribeの値がリストにある素数の１つであるならば、数が素数であることを書き留めるために、関数はdescriptionの終わりにテキストを追加します。

source: If the value of the expression is not nil, the optional value is unwrapped and returned with the corresponding non-optional type.
ja: 式の値がnilでないならば、オプショナルの値は包装を取られて（アンラップされて）、対応する非オプショナル型で返されます。

source: If the value of the expression does not match the value of the return type declared in the function or method declaration, the expression’s value is converted to the return type before it is returned to the calling function or method.
ja: 式の値が関数またはメソッド宣言において宣言される戻り型の値にマッチしないならば、それが関数またはメソッドを呼んでいるところに返される前に、式の値は戻り型に変換されます。

source: If the value of the optional-chaining expression is nil, all of the other operations in the postfix expression are ignored and the entire postfix expression evaluates to nil.
ja: オプショナル連鎖式の値がnilならば、接尾辞式での他の演算の全ては無視されます、そして接尾辞式の全体はnilに評価されます。

source: If the value of the optional-chaining expression is nil, the expression on the right-hand side of the assignment operator is not evaluated.
ja: オプショナル連鎖式の値がnilならば、代入演算子の右手側での式は評価されません。

source: If the value of the optional-chaining expression is not nil, the value of the optional-chaining expression is unwrapped and used to evaluate the rest of the postfix expression.
ja: オプショナル連鎖式の値がnilでないならば、オプショナル連鎖式の値はアンラップされて、接尾辞式の残りを評価するために使われます。

source: If the value returned is not nil, it is assigned to the item pattern, the program executes the statements, and then continues execution at the beginning of the loop.
ja: 返される値がnilでないならば、それはitem（項目）パターンに割り当てられて、プログラムはstatements（文）を実行して、それからループの初めに戻って実行を続けます。

source: If there are expressions of multiple types, T is their closest common supertype.
ja: 複数の型の式があるならば、Tはそれらの最も近い共通のスーパー型です。

source: If there are expressions of multiple types, Key and Value are the closest common supertype for their respective values.
ja: 複数の型の式があるならば、KeyとValueはそれらめいめいの値に対して最も近い共通のスーパー型です。

source: If there are multiple in-out parameters, the write accesses start in the same order as the parameters appear.
ja: 複数のin-outパラメータが存在するならば、書き込みアクセスはパラメータが現れるのと同じ順番で始まります。

source: If there are not enough coins, Bank returns a smaller number than the number that was requested (and returns zero if no coins are left in the bank).
ja: 十分なコインがないならば、Bankは要請された数より少ない数を返します（そしてコインが胴元に残っていないならばゼロを返します）。

source: If there isn’t suitable type information available, Swift infers that the literal’s type is one of the default literal types defined in the Swift standard library.
ja: 適した型情報が得られなかったならば、スウィフトはそのリテラルの型はスウィフト標準ライブラリで定義される省略時のリテラル型の１つと推論します。

source: If they contain a different number of items, there’s no way that they can match, and the function returns false.
ja: それらが異なる数の項目を含むならば、それらが合致することができる術はありません、そして関数はfalseを返します。

source: If this check is not performed, board[square] might try to access a value outside the bounds of the board array, which would trigger a runtime error.
ja: この確認が行われなかったならば、board[square]はboard配列の境界外で値にアクセスしようとするかもしれません、それは実行時エラーを引き起こします。

source: If this is successful, set a new temporary constant called movie to the value stored in the returned optional Movie.”
ja: これが成功するならば、movieと呼ばれる新しい一時的な定数を、返されたオプショナルのMovieに格納される値に設定してください。」

source: If this isn’t the case, Int is preferred, even when the values to be stored are known to be nonnegative.
ja: この場合でないならば、保存される値が負数でないことがわかっている時でさえ、Intがむしろ好まれます。

source: If type information can be inferred, you can write an empty array as [] and an empty dictionary as [:]—for example, when you set a new value for a variable or pass an argument to a function.
ja: 型情報が推論されることが出来るならば、あなたは空の配列を[]のように、そして空の辞書を[:]のように書くことができます ― 例えば、あなたが新しい値を変数に設定したり、関数に引数を渡す時に。

source: If we’ve entered the correct door code and passed the retina scan, or if we have a valid door key, or if we know the emergency override password, then allow access.
ja: 私達が正しいドア・コードを入力して網膜走査をパスしたならば、または私達が有効なドア・キーを持つならば、または私達が非常用解除パスワードを知っているならば、その時アクセスを許可してください。

source: If you access the variable or property after the object has been deallocated, its value is nil.
ja: あなたが変数またはプロパティにそのオブジェクトがデアロケートされてしまった後にアクセスするならば、それの値はnilです。

source: If you add additional cases in the future, the compiler generates a warning to indicate that you need to update the switch statement to take the new cases into account.
ja: あなたが追加のケース節を将来において加えるならば、コンパイラは警告を生成して、あなたがスイッチ文を更新して新しいケース節を考慮に入れる必要があることを指し示します。

source: If you apply the objc attribute to an enumeration, each enumeration case is exposed to Objective-C code as the concatenation of the enumeration name and the case name.
ja: あなたがobjc属性をある列挙に適応したならば、個々の列挙ケース節はObjective-Cコードに列挙名とそのケース節名を連結したものとして暴露されます。

source: If you are familiar with C, you will know that C enumerations assign related names to a set of integer values.
ja: あなたがCに精通しているならば、あなたはCの列挙がひとまとめの整数値それぞれに対して関連した名前を割り当てるということを知っています。

source: If you are working with particularly long string values, be aware that the count property must iterate over the Unicode scalars in the entire string in order to determine the characters for that string.
ja: あなたが特に長い文字列値を扱う場合は、countプロパティは、その文字列の文字を決定する目的で文字列全体のユニコード・スカラーのすべてに繰り返しを行わなければならないことを知っていてください。

source: If you ask it to store a larger number, it stores 12 instead.
ja: あなたがそれにより大きな数を格納するように頼むならば、それは代わりに12を格納します。

source: If you assign a closure to a property of a class instance, and the closure captures that instance by referring to the instance or its members, you will create a strong reference cycle between the closure and the instance.
ja: あなたが、あるクロージャをあるクラスインスタンスのプロパティに代入して、そしてクロージャがそのインスタンスを、インスタンスまたはそのメンバ（属するもの）に言及することによって捕獲するならば、あなたはクロージャとインスタンスの間で強い参照循環をつくります。

source: If you assign a non-nil value to userDefinedColorName and perform the nil-coalescing operator check again, the value wrapped inside userDefinedColorName is used instead of the default:
ja: あなたがnilでない値をuserDefinedColorNameに代入して、nil合体演算子による確認をふたたび実行するならば、userDefinedColorName内にラップされた値は省略時のものの代わりに使用されます。

source: If you assign a value to a property within its own didSet observer, the new value that you assign replaces the one that was just set.
ja: あなたが独自のdidSetオブザーバーの内部で値をプロパティに代入するならば、あなたが代入する新しい値はついさっき設定されたものを置き換えます。

source: If you assign an array, a set, or a dictionary to a constant, that collection is immutable, and its size and contents cannot be changed.
ja: あなたがある配列、集合、または辞書をある定数に代入したならば、そのコレクションは不変になります、そしてそれの大きさと内容は変更されることが出来ません。

source: If you assign an instance of a reference type to a constant, you can still change that instance’s variable properties.
ja: あなたが参照型のインスタンスを定数に代入するならば、あなたは依然としてそのインスタンスの変数プロパティを変えることができます。

source: If you assign the same Person instance to two more variables, two more strong references to that instance are established:
ja: あなたが同じPersonインスタンスをさらに２つの変数に代入するならば、そのインスタンスへのさらに２つの強い参照が確立されます：

source: If you break that strong reference, there are no more strong references to the Apartment instance:
ja: あなたがその強い参照を壊すならば、Apartmentインスタンスへの強い参照はもうこれ以上ありません：

source: If you break two of these strong references (including the original reference) by assigning nil to two of the variables, a single strong reference remains, and the Person instance is not deallocated:
ja: あなたが変数のうちの２つにnilを代入することによってこれらの強い参照のうちの（最初の参照を含む）２つを壊すならば、１つの強い参照が残ります、そしてPersonインスタンスは割り当て解除されません：

source: If you call resize(to: .large), the switch case for .large sets the rectangle’s height and width to 100.
ja: あなたがresize(to: .large)を呼び出すならば、.largeに対するスイッチケース節は、矩形のもつ高さと幅を100に設定します。

source: If you call this function with a Square, it returns a Square; otherwise, it returns a FlippedShape.
ja: あなたがこの関数をSquareで呼び出すならば、それはSquareを返します；そうでなければ、それはFlippedShapeを返します。

source: If you call this method on an optional value with optional chaining, the method’s return type will be Void?, not Void, because return values are always of an optional type when called through optional chaining.
ja: あなたがこのメソッドをあるオプショナルの値の上でオプショナル連鎖を使って呼ぶならば、メソッドの戻り値はVoid?になります、Voidではなく、なぜならば、オプショナル連鎖を通して呼び出されるとき戻り値は常にオプショナルだからです。

source: If you combine integer and floating-point literals in an expression, a type of Double will be inferred from the context:
ja: あなたがある式の中で整数と浮動小数点リテラルを結合するならば、その前後関係からDoubleの型が推論されます：
